CSI API ETABS v1
cDesignSteel.SetCode Method
 Sets the steel design code.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetCode(
	string CodeName
)
Function SetCode (
	CodeName As String
) As Integer
Dim instance As cDesignSteel
Dim CodeName As String
Dim returnValue As Integer
returnValue = instance.SetCode(CodeName)
int SetCode(
	String^ CodeName
)
abstract SetCode :
        CodeName : string -> int
Parameters
CodeName
Type: System.String
 For ETABS, this is one of the following steel design code names.
AISC 360-22
AISC 360-16
AISC 360-10
AISC 360-05
AISC LRFD 93
AISC ASD 89
AS 4100:2020
AS 4100-1998
BS 5950-2000
Chinese 2010
Chinese 2018
CSA S16-24
CSA S16-19
CSA S16-14
CSA S16-09
EN 1993-1-1:2005
IS 800:2007
Italian NTC 2018
Italian NTC 2008
KBC 2009
NZS 3404:1997
SP 16.13330.2017
Return Value
Type: Int32
 Returns zero if the code is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim CodeName As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set steel design code
   ret = SapModel.DesignSteel.SetCode("EN 1993-1-1:2005")
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDesignSteel Interface
ETABSv1 Namespace